<a href="https://colab.research.google.com/github/bakut/packt-data-science-workshop/blob/master/performing_first_clustering_analysis_on_the_ATO_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Performing Your First Clustering Analysis on the ATO Dataset**

In [0]:
#importing libraries
import pandas as pd
from sklearn.cluster import KMeans

In [0]:
#loading dataset into file_url
file_url = 'https://raw.githubusercontent.com/PacktWorkshops/The-Data-Science-Workshop/master/Chapter05/DataSet/taxstats2015.csv'

In [0]:
#using the usecols paramater to subset only columns needed
df = pd.read_csv(file_url, usecols=['Postcode','Average net tax', 'Average total deductions'])

In [5]:
#display slelcted columns
df.head()

   Postcode  Average total deductions  Average net tax
0      2000                      2071            27555
1      2006                      3804            28142
2      2007                      1740            15649
3      2008                      3917            53976
4      2009                      3433            32430

In [6]:


df.tail()

      Postcode  Average total deductions  Average net tax
2468       870                      2377            14788
2469       872                      1218             9017
2470       880                      2309            16574
2471       885                      3039            28795
2472       886                      2191            18141

In [0]:
#instantiate K-means with random state of 42
kmeans = KMeans(random_state=42)

In [0]:
#feed K-means with ytraining data
X = df[['Average net tax', 'Average total deductions']]

In [11]:
kmeans.fit(X)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=8, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=42, tol=0.0001, verbose=0)

In [12]:
#see which cluster each data point belongs to by using .predict() method
y_preds = kmeans.predict(X)
y_preds

array([6, 6, 5, ..., 5, 6, 5], dtype=int32)

In [13]:
#add predictions into the original dataframe
df['cluster'] = y_preds
df

      Postcode  Average total deductions  Average net tax  cluster
0         2000                      2071            27555        6
1         2006                      3804            28142        6
2         2007                      1740            15649        5
3         2008                      3917            53976        7
4         2009                      3433            32430        2
...        ...                       ...              ...      ...
2468       870                      2377            14788        5
2469       872                      1218             9017        0
2470       880                      2309            16574        5
2471       885                      3039            28795        6
2472       886                      2191            18141        5

[2473 rows x 4 columns]

Our k-means model has grouped the first two rows into the same cluster, 1. We can see these two observations both have average net tax values around 28,000. The last three data points have been assigned to different clusters (2, 3, and 7, respectively) and we can see their values for both average total deductions and average net tax are very different from each other. It seems that lower values are grouped into cluster 2 while higher values are classified into cluster 3. We are starting to build our understanding of how k-means has decided to group the observations from this dataset.

This is a great start. You have learned how to train (or fit) a k-means model in a few lines of code. Now we can start diving deeper into the magic behind k-means.